; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image1 - mode
	infrared6 - mode
	infrared4 - mode
	image3 - mode
	infrared0 - mode
	image5 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared4)
	(supports instrument0 image5)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 infrared4)
	(supports instrument1 image5)
	(supports instrument1 infrared6)
	(supports instrument1 infrared2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
)
(:goal (and
	(pointing satellite1 GroundStation0)
	(have_image Planet8 infrared2)
	(have_image Planet8 image5)
	(have_image Planet9 infrared0)
	(have_image Planet10 infrared4)
	(have_image Planet10 infrared0)
	(have_image Phenomenon11 image3)
	(have_image Star12 image3)
	(have_image Star12 image5)
	(have_image Phenomenon13 image1)
	(have_image Phenomenon13 infrared4)
))

)

; plan
1. (turn_to satellite1 groundstation7 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 groundstation7)
   goals met: 0 of 11
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite1 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite1 planet8 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 planet8)
   goals met: 0 of 11
5. (take_image satellite1 planet8 instrument1 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 1 of 11
6. (take_image satellite1 planet8 instrument1 image5)
   added: (have_image planet8 image5)
   goals met: 2 of 11
7. (turn_to satellite1 planet10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet10)
   goals met: 2 of 11
8. (take_image satellite1 planet10 instrument1 infrared4)
   added: (have_image planet10 infrared4)
   goals met: 3 of 11
9. (take_image satellite1 planet10 instrument1 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 4 of 11
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 11
11. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 4 of 11
12. (turn_to satellite0 phenomenon11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 11
13. (take_image satellite0 phenomenon11 instrument0 image3)
   added: (have_image phenomenon11 image3)
   goals met: 5 of 11
14. (turn_to satellite0 phenomenon13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 11
15. (take_image satellite0 phenomenon13 instrument0 image1)
   added: (have_image phenomenon13 image1)
   goals met: 6 of 11
16. (take_image satellite0 phenomenon13 instrument0 infrared4)
   added: (have_image phenomenon13 infrared4)
   goals met: 7 of 11
17. (turn_to satellite0 star12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star12)
   goals met: 7 of 11
18. (take_image satellite0 star12 instrument0 image3)
   added: (have_image star12 image3)
   goals met: 8 of 11
19. (take_image satellite0 star12 instrument0 image5)
   added: (have_image star12 image5)
   goals met: 9 of 11
20. (turn_to satellite1 planet9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet9)
   goals met: 9 of 11
21. (take_image satellite1 planet9 instrument1 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 10 of 11
22. (turn_to satellite1 groundstation0 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation0)
   goals met: 11 of 11
